; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v13 ?v6)
             (pred_1 ?v5 ?v3)
             (pred_3 ?v13 ?v3)
             (pred_10 ?v2 ?v13 )
	     (pred_8 ?v13)
             (pred_11 ?v4)
             (pred_5 ?v5)
             (pred_4 ?v3)
             (pred_2 ?v13)
             (pred_9 ?v5)
             (pred_7 ?v13)
             (pred_6 ))



(:action op_2
:parameters (?v8 ?v11 ?v9 ?v7)
:precondition (and (pred_11 ?v8) (pred_11 ?v11) (pred_5 ?v9) (pred_4 ?v7)
          (pred_12 ?v8 ?v11) (pred_1 ?v9 ?v7)
                   (pred_3 ?v11 ?v7) (pred_8 ?v8) 
                   (pred_2 ?v11) (pred_9 ?v9))
:effect (and  (pred_7 ?v11) (not (pred_2 ?v11))))


(:action op_4
:parameters (?v8 ?v10)
:precondition (and (pred_11 ?v8) (pred_11 ?v10)
               (pred_8 ?v8) (pred_12 ?v8 ?v10) (pred_7 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v8))))

(:action op_5
:parameters (?v8 ?v9)
:precondition (and (pred_11 ?v8) (pred_5 ?v9) 
                  (pred_8 ?v8) (pred_10 ?v9 ?v8) (pred_6 ))
:effect (and (pred_9 ?v9)
   (not (pred_10 ?v9 ?v8)) (not (pred_6 ))))


(:action op_1
:parameters (?v8 ?v1 ?v12)
:precondition (and (pred_11 ?v8) (pred_5 ?v1) (pred_5 ?v12)
                  (pred_8 ?v8) (pred_9 ?v12) (pred_10 ?v1 ?v8))
:effect (and (pred_9 ?v1) (pred_10 ?v12 ?v8)
        (not (pred_9 ?v12)) (not (pred_10 ?v1 ?v8))))

(:action op_3
:parameters (?v8 ?v9)
:precondition (and (pred_11 ?v8) (pred_5 ?v9) 
                  (pred_8 ?v8) (pred_9 ?v9))
:effect (and (pred_6 ) (pred_10 ?v9 ?v8) (not (pred_9 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_20 obj_04 obj_16 obj_03 obj_13 obj_11 obj_21 obj_07 obj_06 obj_18 obj_15 obj_12 obj_01 obj_05 obj_09
    obj_10 obj_22 obj_19
    obj_02 obj_08 obj_14
    )

    (:init
       (pred_6)

       (pred_11 obj_17)
       (pred_11 obj_20)
       (pred_11 obj_04)
       (pred_11 obj_16)
       (pred_11 obj_03)
       (pred_11 obj_13)
       (pred_11 obj_11)
       (pred_11 obj_21)
       (pred_11 obj_07)
       (pred_11 obj_06)
       (pred_11 obj_18)
       (pred_11 obj_15)
       (pred_11 obj_12)
       (pred_11 obj_01)
       (pred_11 obj_05)
       (pred_11 obj_09)
       (pred_4 obj_10)
       (pred_4 obj_22)
       (pred_4 obj_19)
       (pred_5 obj_02)
       (pred_5 obj_08)
       (pred_5 obj_14)

       (pred_12 obj_17 obj_03)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_20 obj_13)
       (pred_12 obj_20 obj_04)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_04 obj_11)
       (pred_12 obj_04 obj_16)
       (pred_12 obj_04 obj_20)
       (pred_12 obj_16 obj_21)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_03 obj_17)
       (pred_12 obj_13 obj_06)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_13 obj_20)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_11 obj_18)
       (pred_12 obj_11 obj_21)
       (pred_12 obj_11 obj_04)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_21 obj_15)
       (pred_12 obj_21 obj_16)
       (pred_12 obj_21 obj_11)
       (pred_12 obj_07 obj_12)
       (pred_12 obj_07 obj_06)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_06 obj_18)
       (pred_12 obj_06 obj_13)
       (pred_12 obj_06 obj_07)
       (pred_12 obj_18 obj_05)
       (pred_12 obj_18 obj_15)
       (pred_12 obj_18 obj_11)
       (pred_12 obj_18 obj_06)
       (pred_12 obj_15 obj_09)
       (pred_12 obj_15 obj_21)
       (pred_12 obj_15 obj_18)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_12 obj_07)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_05 obj_09)
       (pred_12 obj_05 obj_18)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_09 obj_15)
       (pred_12 obj_09 obj_05)
       (pred_2 obj_03)
       (pred_2 obj_09)
       (pred_2 obj_13)
       (pred_3  obj_03 obj_10)
       (pred_3  obj_09 obj_22)
       (pred_3  obj_13 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_20)
       (pred_7 obj_04)
       (pred_7 obj_16)
       (pred_7 obj_11)
       (pred_7 obj_21)
       (pred_7 obj_07)
       (pred_7 obj_06)
       (pred_7 obj_18)
       (pred_7 obj_15)
       (pred_7 obj_12)
       (pred_7 obj_01)
       (pred_7 obj_05)

       (pred_1  obj_02 obj_10)
       (pred_1  obj_08 obj_22)
       (pred_1  obj_14 obj_19)
       (pred_10 obj_02 obj_18)
       (pred_10 obj_08 obj_16)
       (pred_10 obj_14 obj_12)
       (pred_8 obj_18)
    )

    (:goal (and
       (pred_10 obj_02 obj_12)
       (pred_10 obj_08 obj_20)
    ))
(:constraints
  (always (not (pred_8 obj_11)))
)
)

; plan
1. (op_5 obj_18 obj_02)
   deleted: (pred_10 obj_02 obj_18) (pred_6)
   added: (pred_9 obj_02)
   goals met: 0 of 2
2. (op_4 obj_18 obj_06)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_06)
   goals met: 0 of 2
3. (op_4 obj_06 obj_07)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_07)
   goals met: 0 of 2
4. (op_2 obj_07 obj_03 obj_02 obj_10)
   deleted: (pred_2 obj_03)
   added: (pred_7 obj_03)
   goals met: 0 of 2
5. (op_4 obj_07 obj_12)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_12)
   goals met: 0 of 2
6. (op_3 obj_12 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_6) (pred_10 obj_02 obj_12)
   goals met: 1 of 2
7. (op_4 obj_12 obj_07)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_07)
   goals met: 1 of 2
8. (op_4 obj_07 obj_03)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_03)
   goals met: 1 of 2
9. (op_4 obj_03 obj_17)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_17)
   goals met: 1 of 2
10. (op_4 obj_17 obj_20)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_20)
   goals met: 1 of 2
11. (op_4 obj_20 obj_04)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_04)
   goals met: 1 of 2
12. (op_4 obj_04 obj_16)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_16)
   goals met: 1 of 2
13. (op_5 obj_16 obj_08)
   deleted: (pred_10 obj_08 obj_16) (pred_6)
   added: (pred_9 obj_08)
   goals met: 1 of 2
14. (op_4 obj_16 obj_04)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_04)
   goals met: 1 of 2
15. (op_4 obj_04 obj_20)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_20)
   goals met: 1 of 2
16. (op_3 obj_20 obj_08)
   deleted: (pred_9 obj_08)
   added: (pred_6) (pred_10 obj_08 obj_20)
   goals met: 2 of 2
